[
  "Sesungguhnya amal itu tergantung pada niat, dan setiap orang akan mendapatkan apa yang ia niatkan.",
  "Barang siapa yang tidak bersyukur kepada manusia, maka dia tidak bersyukur kepada Allah.",
  "Barang siapa yang menipu kami, maka dia bukan bagian dari kami.",
  "Agama itu adalah nasihat.",
  "Barang siapa yang tidak menyayangi, maka dia tidak akan disayangi.",
  "Amal yang paling disukai oleh Allah adalah yang paling terus menerus meskipun sedikit.",
  "Barang siapa yang menempuh jalan untuk mencari ilmu, Allah akan memudahkan baginya jalan menuju surga.",
  "Barang siapa yang berpuasa di bulan Ramadhan karena iman dan mengharap pahala, diampuni dosa-dosanya yang telah lalu.",
  "Barang siapa yang mendirikan shalat malam di bulan Ramadhan karena iman dan mengharap pahala, diampuni dosa-dosanya yang telah lalu.",
  "Barang siapa yang Allah kehendaki kebaikan padanya, dia akan diberikan pemahaman dalam agama.",
  "Tidak sempurna iman seseorang hingga dia mencintai untuk saudaranya apa yang dia cintai untuk dirinya sendiri.",
  "Sebagian dari kesempurnaan Islam seseorang adalah meninggalkan apa yang tidak berguna baginya.",
  "Barang siapa yang bershalawat kepadaku satu kali, maka Allah akan bershalawat kepadanya sepuluh kali.",
  "Tangan di atas lebih baik daripada tangan di bawah.",
  "Barang siapa yang menutupi aib seorang Muslim, maka Allah akan menutupi aibnya di dunia dan akhirat.",
  "Barang siapa yang tidak bisa membantu saudaranya, janganlah ia menyakiti atau merugikannya.",
  "Barang siapa yang terbunuh karena melindungi hartanya, maka dia adalah seorang syahid.",
  "Barang siapa yang berjihad di jalan Allah dan berhasil, maka baginya pahala yang besar.",
  "Barang siapa yang tidak bersyukur kepada manusia, maka dia tidak bersyukur kepada Allah.",
  "Barang siapa yang menyakiti seorang Muslim, maka dia telah menyakiti Allah.",
  "Barang siapa yang meninggalkan sesuatu karena Allah, Allah akan menggantikan dengan yang lebih baik.",
  "Barang siapa yang merasa lebih baik dari yang lain, maka ia telah jatuh dalam hasad.",
  "Barang siapa yang jujur kepada Allah, Allah akan membalas kejujurannya.",
  "Barang siapa yang sabar terhadap musibah yang menimpanya, Allah akan menggantinya dengan yang lebih baik.",
  "Barang siapa yang melihat kemungkaran, hendaklah ia mengubahnya dengan tangannya.",
  "Barang siapa yang meminta surga kepada Allah tiga kali, maka surga akan berkata: Ya Allah, masukkan dia ke surga.",
  "Barang siapa yang membangun masjid untuk Allah, Allah akan membangunkan untuknya sebuah rumah di surga.",
  "Barang siapa yang menuntut ilmu, maka ia akan memperoleh pahala seperti pahala orang yang mengajarkannya.",
  "Barang siapa yang memuliakan istrinya, maka Allah akan memuliakannya.",
  "Barang siapa yang mencari ilmu di jalan Allah, maka malaikat akan menyertainya.",
  "Barang siapa yang menyembunyikan ilmu yang ia ketahui, akan dikenakan cambuk dari api neraka.",
  "Barang siapa yang meninggalkan apa yang tidak berguna bagi dirinya, maka itu adalah sebagian dari kesempurnaan Islamnya.",
  "Barang siapa yang diberi rezeki, maka mulailah dengan memberi nafkah kepada dirinya sendiri dan keluarganya.",
  "Barang siapa yang melindungi kehormatan saudaranya, Allah akan melindunginya dari api neraka.",
  "Barang siapa yang terbunuh karena mempertahankan hartanya, maka ia adalah seorang syahid.",
  "Barang siapa yang diuji dengan suatu musibah, maka bersabarlah, karena Allah akan memberikan pengganti yang lebih baik.",
  "Barang siapa yang memberi kepada Allah dan memberi kepada manusia, maka baginya pahala di sisi Allah.",
  "Barang siapa yang merendahkan dirinya kepada Allah, maka Allah akan mengangkat derajatnya."
]
